//Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.


// System.Console.Write("Введите трехзначное число: ");
// int a = Convert.ToInt32(Console.ReadLine());
// int d2 = a % 100 / 10; // Вторая цифра
// System.Console.WriteLine(d2);


//адача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.


// System.Console.Write("Введите трехзначное число: ");
// int a = Convert.ToInt32(Console.ReadLine());
// if(a <= 99){
//     System.Console.WriteLine("Третьей цифры нет"); //Проверка числа 
// }
// else{
//     int d3 = a / 100 % 10; // Третья цифра
//     System.Console.WriteLine(d3);
// }

//Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.







// System.Console.Write("Введите трехзначное число: ");
// int a = Convert.ToInt32(Console.ReadLine());

// int d1 = a % 10;  // Первая цифра
// int d2 = a % 100 / 10; // Вторая цифра
// int d3 = a / 100 % 10; // Третья цифра

// Console.WriteLine($"Первая цифра {d1}, вторая цифра {d2}, третья {d3}");
// System.Console.WriteLine(d3*10 + d1);
// //Console.ReadLine(a);